package practice_stepik;
public class Basic_course{
        public static void main(String[] args) {
//                double a = 0.1;
//                double b = 0.2;
//                double c = 0.3;
//
//                System.out.println(Math.abs((a + b) - c) < 0.0001);

//----------------------------------------------------------------------
// Реализуйте метод, который возвращает букву,
// стоящую в таблице UNICODE после символа "\" (обратный слэш) на расстоянии a.
//В качестве примера написано заведомо неправильное выражение. Исправьте его.

//                public static char charExpression(int a) {
//                        int s = '\\';
//                        int total = s + a;
//                        char unicode = (char) total;
//                        return unicode;
//                }

//------------------------------------------------------------------------








        }
}
