package practice_stepik;
import java.util.Scanner;
public class cycles {
    public static void main(String[] args){
//        int x = 3;
//
//        while (x > 0) {
//            System.out.println(x);
//            x--;
//        }
//  ________________________________
//  Сколько раз код выведет на печать фразу "Java rocks!"?
//        int x = 12;
//
//        while (x < 100) {
//            x += 10;
//            System.out.println("Java rocks!");
//        }
//    ответ 9 без запуска кода
//__________________________________________________________________
//        int x = 6;
//
//        while (x < 10) {
//            System.out.println("Цикл исполняется");
//            System.out.println("x = " + x);
//            x++;
//        }
//        System.out.println("Цикл завершён");
//        System.out.println("x = " + x);
//-----------------------------------------------------------------------
// Что выведет на печать следующий код? (без запуска кода ответ)
//        int x = 5;
//        String s = "start";
//
//        while (x > 0) {
//            if (x < 10) {
//                s = "smaller";
//            } else {
//                s = "bigger";
//            }
//        }
//        s = "end";
//        System.out.println(s);
//ответ:Ничего из вышеперечисленного

//---------------------------------------------------На вход подаётся натуральное число n.
// Выведите на печать числа от единицы до введённого числа включительно, каждое на новой строке.
//        Scanner sc = new Scanner(System.in);
//        int n = sc.nextInt();
//        int x = 1;
//        while (x <= n){
//            System.out.println(x);
//            x++;
//        }
//-------------------------------------------------------------------
// На ввод подаётся натуральное число n.
// Выведите на печать в возрастающем порядке через пробел квадраты натуральных чисел,
// если эти квадраты не превышают n.
//        Scanner sc = new Scanner(System.in);
//              int n = sc.nextInt();
//              int x = 1;
//              while ((x*x)<=n) {
//                  System.out.print((x*x) + " ");
//                  x++;
//              }
//        ------------------------------------------------------------------

    }
}
