package practice_stepik;
import java.util.ArrayList;
import java.util.Scanner;
import java.util.Arrays;
import java.util.Collections;
public class Workshop_on_programming {
    public static void main(String[] args) {
//        ----------------------------------------------------
//        Дано два числа a и b. Найдите гипотенузу треугольника с заданными катетами.
//        Выведите ответ на задачу в виде целого числа
//        Scanner sc = new Scanner(System.in);
//        int a = sc.nextInt();
//        int b = sc.nextInt();
//        int num = a*a+b*b;
//        System.out.println(Math.round(Math.sqrt(num)));



//          --------------------------------------------------
//          Напишите программу, которая считывает целое число и выводит текст,
//          аналогичный приведенному в примере.
//          Пробелы, знаки препинания, заглавные и строчные буквы важны!
//          Выведите сначала фразу "The next number for the number ",
//          затем введенное число, затем слово " is ", окруженное пробелами,
//          затем формулу для следующего за введенным числа,
//          наконец, знак точки без пробела.
//          Аналогично в следующей строке для предыдущего числа.
//        Scanner sc = new Scanner(System.in);
//        int a = sc.nextInt();
//        String str = "The next number for the number";
//        String str1 = "is";
//        String str2 = "The previous number for the number";
//        System.out.println(str + " " + a + " "+ str1 + " " + (a+1)+ ".");
//        System.out.println(str2 + " " + a + " "+ str1 + " " + (a-1)+ ".");



//        -----------------------------------------------------
//        N школьников делят K яблок поровну, неделящийся остаток остается в корзинке.
//        Сколько яблок достанется каждому школьнику?
//        Scanner sc = new Scanner(System.in);
//        int N = sc.nextInt();
//        int K = sc.nextInt();
//        int S = K/N;
//        System.out.println(S);



//        -------------------------------------------------------
//        N школьников делят K яблок поровну,
//        неделящийся остаток остается в корзинке.
//        Сколько яблок останется в корзинке?
//        Scanner sc = new Scanner(System.in);
//        int N = sc.nextInt();
//        int K = sc.nextInt();
//        int S = K%N;
//       System.out.println(S);



//          --------------------------------------------------------
//          Длина Московской кольцевой автомобильной дороги — 109 километров.
//          Байкер Вася стартует с нулевого километра МКАД и едет со скоростью v километров в час.
//          На какой отметке он остановится через t часов?
//          Программа получает на вход значения v и t.
//          Если v>0, то Вася движется в положительном направлении по МКАД, если же значение v<0,то в отрицательном.

//            Scanner sc = new Scanner(System.in);
//            int v = sc.nextInt();
//            int t = sc.nextInt();
//            int d=109;
//            int s = v*t;
//            int x = s%d;
//
//        if(v<0){
//            System.out.println(d+x);
//        }else {
//            System.out.println(x);
//        }



//            ------------------------------------------------------------
//            Дано натуральное число. Выведите его последнюю цифру.
//            Scanner sc = new Scanner(System.in);
//            int n = sc.nextInt();
//            int x=n%10;
//            System.out.println(x);



//        --------------------------------------------------------------
//        Дано двузначное число. Найдите число десятков в нем.

//        Scanner sc = new Scanner(System.in);
//           int n = sc.nextInt();
//           int x=n/10%10;
//           if(n<0){
//               int m=-1;
//               System.out.println(x*m);
//           }else {
//               System.out.println(x);
//           }

//        -----------------------------------------------------------
    }
}
